package ru.sxtim.chat.server;
/** Server  - некая сущность которая может принимать сообщения и рассылать нескольким клиентам
* Может держать несколько соединений активными;
* Взаимодействие с сетью происходит с помощью двух основных классов: ServerSocket, Socket;
* ServerSocket умеет слушать входящее соединение, создавать объект сокета, который
 связан с этим соединением, и готовый сокет отдавать;
* Socket устанавливает соединение;

*/
public class ChatServer {
    public static void main(String[] args) {

    }
}
